# Настройки графического окна
SCREEN_WIDTH = 800
SCREEN_HEIGHT = 600
FPS = 60

# Размер одного блока карты
BLOCK_SIZE = 20

# Цветовая палитра (RGB)
COLOR_BG = (25, 25, 30)
COLOR_PLATFORM = (60, 65, 70)
COLOR_FIRE = (255, 70, 0)
COLOR_WATER = (0, 150, 255)

# Физические константы (настройки перемещения)
GRAVITY = 0.5
JUMP_FORCE = -12
MOVE_SPEED = 5

# Размеры персонажей
PLAYER_WIDTH = 32
PLAYER_HEIGHT = 40

# Настройки магнитной физики
MAGNET_FORCE = 1.2 # Базовая сила магнита
MAGNET_RADIUS = 160 # Радиус действия магнита в пикселях

# Цвета для магнитов
COLOR_N = (220, 50, 50)  # Яркий красный (Север)
COLOR_S = (50, 50, 220)  # Яркий синий (Юг)

COLOR_CRYSTAL = (0, 255, 255)  # Бирюзовый цвет для кристаллов
COLOR_EXIT = (0, 255, 0)       # Зеленый цвет для дверей финиша

COLOR_LAVA = (255, 0, 0)       # Красный цвет для ловушек/лавы (символ X)
